<?php

/* 
9. *Объединить две ранее написанные функции в одну, которая получает строку 
    на русском языке, производит транслитерацию и замену пробелов на 
    подчеркивания (аналогичная задача решается при конструировании 
    url-адресов на основе названия статьи в блогах).
 */

function translitWithWhitespace ($str) {
  $translit = 
    [
      'а' => 'a',
      'А' => 'A',
      'б' => 'b',
      'Б' => 'B',
      'в' => 'v',
      'В' => 'V',
      'г' => 'g',
      'Г' => 'G',
      'д' => 'd',
      'Д' => 'D',
      'е' => 'e',
      'Е' => 'E',
      'ё' => 'yo',
      'Ё' => 'YO',
      'ж' => 'zh',
      'Ж' => 'ZH',
      'з' => 'z',
      'З' => 'Z',
      'и' => 'i',
      'И' => 'I',
      'й' => 'j',
      'Й' => 'J',
      'к' => 'k',
      'К' => 'K',
      'л' => 'l',
      'Л' => 'L',
      'м' => 'm',
      'М' => 'M',
      'н' => 'n',
      'Н' => 'N',
      'о' => 'o',
      'О' => 'O',
      'п' => 'p',
      'П' => 'P',
      'р' => 'r',
      'Р' => 'R',
      'с' => 's',
      'С' => 'S',
      'т' => 't',
      'Т' => 'T',
      'у' => 'u',
      'У' => 'U',
      'ф' => 'f',
      'Ф' => 'F',
      'х' => 'h',
      'Х' => 'H',
      'ц' => 'c',
      'Ц' => 'C',
      'ч' => 'ch',
      'Ч' => 'CH',
      'ш' => 'sh',
      'Ш' => 'SH',
      'щ' => 'shch',
      'Щ' => 'SHCH',
      'ъ' => "''",
      'Ъ' => "''",
      'ы' => 'y',
      'Ы' => 'Y',
      'ь' => "'",
      'Ь' => "'",
      'э' => 'eh',
      'Э' => 'EH',
      'ю' => 'yu',
      'Ю' => 'YU',
      'я' => 'ya',
      'Я' => 'YA'
    ];
  
    $str = strtr($str, $translit);

    $search = " ";
    $replace = "_";
    
    $str = str_replace($search, $replace, $str);
    
    return $str;
}

$str = "Это строка, в которой нужно заменить все пробелы на знаки подчеркивания и еще сделать транслитерацию!";

echo translitWithWhitespace($str);