<?php

/* 
4.  Объявить массив, индексами которого являются буквы русского языка, 
    а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, 
    ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).

    Написать функцию транслитерации строк.
 */
function translit ($str) {
  $translit = 
    [
      'а' => 'a',
      'А' => 'A',
      'б' => 'b',
      'Б' => 'B',
      'в' => 'v',
      'В' => 'V',
      'г' => 'g',
      'Г' => 'G',
      'д' => 'd',
      'Д' => 'D',
      'е' => 'e',
      'Е' => 'E',
      'ё' => 'yo',
      'Ё' => 'YO',
      'ж' => 'zh',
      'Ж' => 'ZH',
      'з' => 'z',
      'З' => 'Z',
      'и' => 'i',
      'И' => 'I',
      'й' => 'j',
      'Й' => 'J',
      'к' => 'k',
      'К' => 'K',
      'л' => 'l',
      'Л' => 'L',
      'м' => 'm',
      'М' => 'M',
      'н' => 'n',
      'Н' => 'N',
      'о' => 'o',
      'О' => 'O',
      'п' => 'p',
      'П' => 'P',
      'р' => 'r',
      'Р' => 'R',
      'с' => 's',
      'С' => 'S',
      'т' => 't',
      'Т' => 'T',
      'у' => 'u',
      'У' => 'U',
      'ф' => 'f',
      'Ф' => 'F',
      'х' => 'h',
      'Х' => 'H',
      'ц' => 'c',
      'Ц' => 'C',
      'ч' => 'ch',
      'Ч' => 'CH',
      'ш' => 'sh',
      'Ш' => 'SH',
      'щ' => 'shch',
      'Щ' => 'SHCH',
      'ъ' => "''",
      'Ъ' => "''",
      'ы' => 'y',
      'Ы' => 'Y',
      'ь' => "'",
      'Ь' => "'",
      'э' => 'eh',
      'Э' => 'EH',
      'ю' => 'yu',
      'Ю' => 'YU',
      'я' => 'ya',
      'Я' => 'YA'
    ];
  
    return strtr($str, $translit);
    
//-------------------------------------------
// Это попытки реализовать все вручную
// получилось, но достаточно много кода.
//-------------------------------------------     
//  for ($i = 0; $i< mb_strlen($str); $i++){
//    $currentLetter = mb_substr($str, $i, 1);
//    $notFound = TRUE;
//    
//    foreach ($translit as $key => $value) {
//      if ($key == $currentLetter) {
//        $newStr .= $value;
//        $notFound = FALSE;
//        break;
//      } 
//    }
//    if ($notFound) {
//      $newStr .= $currentLetter;
//    }
//  }
//  echo $newStr;
}

echo translit("Привет мир!");
echo '<br>';
echo translit("БОЛЬШАЯ СТРОКА, КОТОРАЯ НАПИСАНА ВСЯ ЗАГЛАВНЫМИ БУКВАМИ.");